fabiankung/Two_Wheels_Robot_V0_90S_OS/Firmware_Release/dsPIC33E_BoardSupport.c
///////////////////////////////////////////////////////////////////////////////////////////////////
//
//  APPLICATION PROGRAM INTERFACE ROUTINES FOR dsPIC33EXXXX MICROCONTROLLER
//   
///////////////////////////////////////////////////////////////////////////////////////////////////
//
// Filename         : os_dsPIC33E_BoardSupport.c
// Author           : Fabian Kung
// Last modified	: 28 June 2019
//
// Toolsuites		: Microchip MPLAB X IDE v5.10 or above
//                	  MPLAB XC-16 C-Compiler v1.33 or above
// Microcontroller	: dsPIC33E families.

// Include common header to all drivers and sources.  Here absolute path is used.
// To edit if one changes folder
#include "dsPIC33E_BoardSupport.h"

// --- GLOBAL AND EXTERNAL VARIABLES DECLARATION ---

// --- FUNCTIONS' PROTOTYPES ---
void ClearWatchDog(void);
void dsPIC33E_PORInit(int);

// --- REGISTER FOR STORING PROCESSOR'S INTERRUPT CONTEXT ---
unsigned char bytIEC0bak;
unsigned char bytIEC1bak;
unsigned char bytIEC2bak;


// --- FUNCTIONS' BODY ---

//////////////////////////////////////////////////////////////////////////////////////////////
//  BEGINNING OF CODES SPECIFIC TO dsPIC33EXXXX MICROCONTROLLER	//////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////


// Configuration bits setting for the microcontroller in the header file "p33EP256MU806.h".

#pragma config FCKSM = CSDCMD   // Disable Fail-safe Clock Monitor and Clock-switching.
#pragma config IOL1WAY = OFF    // Allow multiple peripheral pin select configuration.
#pragma config OSCIOFNC = OFF   // OSC2 pin as oscillator output.
#pragma config POSCMD = XT     // Primary oscillator mode is XT (crylstal oscillator).
#pragma config FNOSC = PRIPLL   // Primary oscillator, XT mode with phase-locked loop.
							   // Note: the actual clock frequency is determined by setting the 
							   // feedback divider M, pre-divider N1 and post-divider N2 of the 
							   // PLL system in the Power-On Reset initialization routines.
							   // On power-up the processor will runs at the oscillator frequency,
							   // which is 4MHz in this case.

#pragma config FWDTEN = ON                          // Enable Watch-dog Timer.
//#pragma config FWDTEN = OFF                          // Disable Watch-dog Timer.
#pragma config BOREN = ON //& BOREN_ON              // Enable brown-out reset.
#pragma config FPWRT = PWR32                        // Set power-on reset timer to 32 msec.
//#pragma config GSS = ON                           // User program memory is code-protected.
                                                    // Note: whenever either GSS or GWRP is ON, the GSSK must be ON to
                                                    // ensure proper operation.
#pragma config GSS = ON                             // User program memory is code-protected but still writable.
#pragma config GWRP = OFF                           // Here we enable general section (GS) code protection,
#pragma config GSSK = ON                            // but still allows the user program to modify the general section,
                                                    // e.g. write protection OFF.

// Interrupt Service Routine 
// Author           : Fabian Kung
// Last modified	: 28 June 2019
// Purpose          : 
//
// Arguments		: None
// Return           : None
void __attribute__((__interrupt__)) _T1Interrupt( void )
{
    if (IFS0bits.T1IF)                                                          // If it is Timer 1 overflow interrupt
    { 
		OSEnterCritical();
        gnRunTask = 1;                          
		PR1 = __TIMER1COUNT;				// Load Period Register.
 		IFS0bits.T1IF = 0;					// reset Timer 1 interrupt flag.
		OSExitCritical(); 	
    }
}     

void __attribute__((__interrupt__)) _MathError( void )
{
    PIN_ILED2 = 0;						// Turn off indicator LED2.
    PIN_PSW = 0;                        // Turn off analog power supply.
    while (1)
    {
        ClearWatchDog();			    // Clear the Watch Dog Timer.
        PIN_OSPROCE1 = 1; 				// Turn on indicator LED1.
        PIN_ILED2 = 1;					// Turn on indicator LED2.
    }
}

void __attribute__((__interrupt__)) _AddressError( void )
{
    PIN_ILED2 = 0;						// Turn off indicator LED2.
    PIN_PSW = 0;                        // Turn off analog power supply.
    while (1)
    {
        ClearWatchDog();			    // Clear the Watch Dog Timer.
        PIN_OSPROCE1 = 1; 				// Turn on indicator LED1.
        PIN_ILED2 = 1;					// Turn on indicator LED2.
    }
}

void __attribute__((__interrupt__)) _HardTrapError( void )
{
    PIN_ILED2 = 0;						// Turn off indicator LED2.
    PIN_PSW = 0;                        // Turn off analog power supply.
    while (1)
    {
        ClearWatchDog();			    // Clear the Watch Dog Timer.
        PIN_OSPROCE1 = 1; 				// Turn on indicator LED1.
        PIN_ILED2 = 1;					// Turn on indicator LED2.
    }
}

void __attribute__((__interrupt__)) _StackError( void )
{
    PIN_ILED2 = 0;						// Turn off indicator LED2.
    PIN_PSW = 0;                        // Turn off analog power supply.
    while (1)
    {
        ClearWatchDog();			    // Clear the Watch Dog Timer.
        PIN_OSPROCE1 = 1; 				// Turn on indicator LED1.
        PIN_ILED2 = 1;					// Turn on indicator LED2.
    }
}

void __attribute__((__interrupt__)) _SoftTrapError( void )
{
    PIN_ILED2 = 0;						// Turn off indicator LED2.
    PIN_PSW = 0;                        // Turn off analog power supply.
    while (1)
    {
        ClearWatchDog();			    // Clear the Watch Dog Timer.
        PIN_OSPROCE1 = 1; 				// Turn on indicator LED1.
        PIN_ILED2 = 1;					// Turn on indicator LED2.
    }
}

void __attribute__((__interrupt__)) _DMACError( void )
{
    PIN_ILED2 = 0;						// Turn off indicator LED2.
    PIN_PSW = 0;                        // Turn off analog power supply.
    while (1)
    {
        ClearWatchDog();			    // Clear the Watch Dog Timer.
        PIN_OSPROCE1 = 1; 				// Turn on indicator LED1.
        PIN_ILED2 = 1;					// Turn on indicator LED2.
    }
}

// Function name	: ClearWatchDog 
// Author           : Fabian Kung
// Last modified	: 28 June 2019
// Purpose          : Reset the Watch Dog Timer
// Arguments		: None
// Return           : None
void ClearWatchDog(void)
{
	asm ("clrwdt");	// Inline assembly instruction to clear the Watch Dog Timer.
}

