fabiankung/Two_Wheels_Robot_V0_90S_OS/Firmware_Release/dsPIC33E_BoardSupport.c
// Function Name	: dsPIC33E_PORInit
// Author           : Fabian Kung
// Last modified	: 28 June 2019
// Description		: Perform power-on reset (POR) initialization on the microcontroller.
//                    Upon completion of this routine, all the microcontroller peripherals and
//                    I/O ports will be set to known state. For I/O ports, all pins will
//                    be set to
//                    (a) Digital mode,
//                    (b) Output and
//                    (c) A logic '0'.
// Arguments		: nProcessorClockMHz - Processor clock frequency, valid values are 120, 130 or 140 MHz.
//                    If not valid input is provided, the processor clock defaults to 120 MHz.
// Return           : None
// 
void dsPIC33E_PORInit(int nProcessorClockMHz)
{

	// Sets the internal phase-locked loop (PLL) for clock generation.
	// Oscillator frequency = Fin = 4MHz.
	// Fclk = Fin (M/(N1XN2).  
	// M = PLL feedback divider = PLLDIV + 2
	// N1 = Pre-divider into PLL = PLLPRE + 2
	// N2 = Post-divider from voltage-controlled oscillator (VCO) of PLL = 2(PLLPOST + 1)
	// If we are setting Fclk to 120MHz for 60MIPS operation (2 clock cycle per instruction).
    // The following selections are used:
    // Option 1: M = 120, N1 = 2, N2 = 2 and Fin = 4 MHz, Fclk = 120 MHz.
    // or PLLDIV = 118 = b'01110110', PLLPRE = 0, PLLPOST = 0.
	// Option 2,3 and 4: For slightly higher clock speed (with slightly higher power dissipation)
    // M = 124, N1 = 2, N2 = 2 and Fin = 4 MHz, Fclk = 124 MHz.
    // or PLLDIV = 122, PLLPRE = 0, PLLPOST = 0.
    // M = 128, N1 = 2, N2 = 2 and Fin = 4 MHz, Fclk = 128 MHz.
    // or PLLDIV = 126, PLLPRE = 0, PLLPOST = 0.
    // M = 132, N1 = 2, N2 = 2 and Fin = 4 MHz, Fclk = 132 MHz.
    // or PLLDIV = 130, PLLPRE = 0, PLLPOST = 0.
    
    if (nProcessorClockMHz == 140)
    {
        PLLFBD = 138; // Clock option 3, sets PLLDIV = 140, Option 3, Fclk = 140 MHz
    }
    else if (nProcessorClockMHz == 130)
    {
        PLLFBD = 128; // Clock option 2, sets PLLDIV = 130, Option 2, Fclk = 130 MHz
    }
    else
    {
        PLLFBD = 118;
        //PLLFBD = 0x0076; // Clock option 1, sets PLLDIV = 120. Option 1, Fclk = 120 MHz.
    }    
    
    CLKDIV = 0x0000; // Sets PLLPRE = 0 and PLLPOST = 0.
                     // Peripheral clock = processor clock.
                     // Internal fast RC oscillator post scaler = 1.
                     // Fcy divided by 1, e.g. processor clock = fosc/2.

	// I/O port setting:
	// Port B setting, all Port B pins are set to outputs by default to prevent floating inputs.
	LATB = 0x0000;
	TRISB = 0x0000;
    ANSELB = 0x0000;        // Set all pins of Port B to digital by default.  This is important as dsPIC33E
                            // sets all analog capable pins to analog mode on power up.
                            // Port B pins are mapped to ADC inputs.

    TRISBbits.TRISB0 = 1;   // Set RB0 to input.  This is the input from voltage reference IC.

	// Port C setting, all Port C pins are set to outputs by default to prevent floating inputs.
	LATC = 0x0000;	
	TRISC = 0x0000;

    // Port D setting, all Port D pins are set to outputs by default to prevent floating inputs.
	LATD = 0x0000;
	TRISD = 0x0000;

    // Port E setting, all Port E pins are set to digital mode, and outputs by
    // default to prevent floating inputs.
	LATE = 0x0000;
	TRISE = 0x0000;
    ANSELE = 0x0000;        // Set all pins to digital be default.  This is important as dsPIC33E
                            // sets all analog capable pins to analog mode on power up.

    // Port F setting, all Port F pins are set to outputs by default to prevent floating inputs.
	LATF = 0x0000;
	TRISF = 0x0000;

    // Port G setting, all Port g pins are set to outputs by default to prevent floating inputs.
	LATG = 0x0000;
	TRISG = 0x0000;
    ANSELG = 0x0000;        // Set all pins of Port G to digital by default.  Port G pins are
                                // mapped to Analog Comparator inputs.
	// Setup 16-bit Timer1:
	// Note - Timer1 will be driven by internal clock cycle.  It will increase up 
	// to the value set in PR1, then reset back to 0. An interrupt will be triggered
	// during this event, known as Timer1 overflow.  
	// Set Timer1 to default state first.
	T1CON = 0;
	// Pre-scaler = 1:1, valid value 0-3 (2 bits).
	T1CONbits.TCKPS = 0;    // Clock source from internal oscillator (peripheral clock).
	// Load Period Register.
	PR1 = __TIMER1COUNT;	
	// Reset Timer1 register.		
	TMR1 = 0; 
	// reset Timer 1 interrupt flag.
 	IFS0bits.T1IF = 0;
 	// set Timer1 interrupt priority level to 1 (highest priority).
	IPC0bits.T1IP = 1;
	// enable Timer 1 interrupt.
 	IEC0bits.T1IE = 1;
	// Turn on Timer1 and start counting.
	T1CONbits.TON = 1; // Turn on Timer1.
}

// Function name	: OSEnterCritical
// Author           : Fabian Kung
// Last modified	: 28 June 2019
// Description		: Disable all processor interrupts for important tasks
//                    involving Stacks, Program Counter other critical
//	                  processor registers.
void OSEnterCritical(void)
{
	bytIEC0bak = IEC0;	// Store current processor interrupt settings.
	bytIEC1bak = IEC1;
	bytIEC2bak = IEC2;
	IEC0 = 0x00;		// Disable all processor interrupts.
	IEC1 = 0x00;
	IEC2 = 0x00;
}											

// Function name	: OSExitCritical
// Author           : Fabian Kung
// Last modified	: 28 June 2019
// Description		: Enable all processor interrupts for important tasks.
void OSExitCritical(void)
{
    IEC0 = bytIEC0bak;	// Restore processor interrupt settings.
    IEC1 = bytIEC1bak;
    IEC2 = bytIEC2bak;
}											

// Function name	: BlinkLED
// Author           : Fabian Kung
// Last modified	: 29 Oct 2019
// Description		: Blink an indicator LED1 to show that the microcontroller is 'alive'.
#define _LED1_ON_MS	500		// LED1 on period in msec, i.e. 500 msec.

void BlinkLED(void)
{
    static int  nState = 0;
    static int  nTimer = 1;
    
