fabiankung/Two_Wheels_Robot_V0_90S_OS/Firmware_Release/dsPIC33E_BoardSupport.c
            case 10: // State 10 - Keep on reading the receive buffer to clear the receive status flag.
                     // Note: 1 May 2015, I noticed that upon power up, the UART module may contains invalid
                     // data, and the URXDA flag will be set to 1.  Thus we should clear this before
                     // proceeding. 
                if (U1STAbits.URXDA == 1)
                {
                    gbytRXbuffer[gbytRXbufptr] = U1RXREG;               // Read the receive buffer.
                    nState = 10;
                    nTimer = 1; 
                }
                else
                {
                    nState = 1;
                    nTimer = 1; 
                }
            break;

			default:
                nState = 0;
                nTimer = 1; 
			break;
		}
	}
}


// Data buffer and address pointers for wired I2C serial communications.
#define     __MAX_I2C_DATA_BYTE               16     // Number of bytes for I2C receive and transmit buffer.
#define     __I2C_TIMEOUT_COUNT               25    // No. of system ticks before the I2C routine timeout during
                                                    // read data stage.
//#define     __I2C_BAUD_RATE_MHZ               0.2   // 200 kHz
#define     __I2C_BAUD_RATE_MHZ               0.4   // 400 kHz

I2C_STATUS  gI2CStat;                   // I2C status.
BYTE        gbytI2CSlaveAdd;            // Slave address (7 bit, from bit0-bit6).
BYTE        gbytI2CRegAdd;              // Slave register address.
BYTE        gbytI2CByteCount;           // No. of bytes to read or write to Slave.
BYTE        gbytI2CRXbuf[__MAX_I2C_DATA_BYTE];                // Data read from Slave register.
BYTE        gbytI2CTXbuf[__MAX_I2C_DATA_BYTE];               // Data to write to Slave register.

///
/// Function name	: I2CDriver
///
/// Author          : Fabian Kung
///
/// Last modified	: 30 Oct 2019
///
/// Code Version	: 0.95
///
/// Processor/System Resource
/// PINS            : 1. Pin RF5 = I2C2 SCL, output.
///                   2. Pin RF4 = I2C2 SDA, input/output.
///
/// MODULES         : 1. I2C2 (Internal).
///
/// RTOS            : Ver 1 or above, round-robin scheduling.
///
/// Global Variables    :

///
/// Description	:
/// This is a driver routines for I2C2 module of the dsPIC33E processor.  Due to the pin
/// assignment of the dsPIC33E core, I2C1 module cannot be used as the pins are already
/// in use for other application.  
/// The operation mode is the dsPIC33E processor assume the role of I2C Master, with
/// multiple slave devices.
/// This driver handles the low-level transmit and receive operations. 
/// Ver 0.91, 15 Nov 2015 - Basic version.
/// Ver 0.95, 17 Aug 2016 - Improved efficiency of multi-bytes read.
/// Ver 0.96, 3 April 2018 - Further improvement in efficiency of multi-bytes read.
/// Ver 0.97, 13 July 2018 - Further improve the efficiency of multi-bytes read by 1 clock tick! 

/// I2C bus properties:
/// Baud rate = 200 kHz.
/// Mode: Single Master.
///
/// --- Example of usage: Transmit operation ---
/// Suppose we want to update the registers of a Slave device:
/// Register address 0x20: data = 0xFA
/// Register address 0x21: data = 0xCD
/// The Slave device has an address 0x1E.
///
/// The codes as follows:
/// if (gI2CStat.bI2CBusy == 0)     // Make sure I2C module is not being used.
/// {
///     gbytI2CByteCount = 2;       // Indicate no. of bytes to transmit.
///     gbytI2CRegAdd = 0x20;       // Start address of register.
///     gbytI2CTXbuf[0] = 0xFA;
///     gbytI2CTXbuf[1] = 0xCD;
///     gbytI2CSlaveAdd =  0x1E;
///     gI2CStat.bSend = 1;
/// }
/// The user routine can monitor the flag gI2CStat.bI2CBusy or gI2CStat.bSend.  Once the
/// transmission is completed, both flags will be cleared by the driver.
///
/// --- Example of usage: Receive operation ---
/// Suppose we want to receive 1 byte from the Slave device:
/// Register address 0x30.
/// Slave device address: 0x1E.
///
/// if (gI2CStat.bI2CBusy == 0)     // Make sure I2C module is not being used.
/// {
///     gbytI2CByteCount = 1;       // Indicate no. of bytes to read.
///     gbytI2CRegAdd = 0x30;       // Start address of register.
///     gbytI2CSlaveAdd =  0x1E;
///     gI2CStat.bRead = 1;
/// }
/// The user routine can monitor the flag gI2CStat.bI2CBusy or gI2CStat.bRead.  Once the
/// reception is completed, both flags will be cleared by the driver.  The received
/// data will be stored in gbytI2CRXbuf[0].
/// if (gI2CStat.bRead == 0)       // Check if Read operation is completed.
/// {                              // Read operation complete, check received data.
///     User codes here
/// }
/// else if (gI2CStat.bCommError == 1)  // Check for I2C bus error.
/// {
/// }

void I2CDriver(void)
{
    static int  nState = 0;
    static int  nTimer = 1;    
    static int nIndex = 0;
    static int nTimeOut = 0;
    static int nCount = 0;

    nTimer--;                   // Decrement timer.
    if (nTimer == 0)
    {
        switch (nState)
        {
            case 0: // State 0 - Initialization of I2C2 module and set as Master mode.
                gI2CStat.bCommError = 0;                // Clear error flag.
                gI2CStat.bI2CBusy = 1;                  // Initially indicates I2C module is busy.
                gbytI2CRXbuf[0] = 0;                    // Once it is ready we will clear the busy flag.
                gbytI2CRegAdd = 0;
                gI2CStat.bSend = 0;
                gI2CStat.bRead = 0;

                // Note: 23 July 2015.  According to the datasheet for dsPIC33EP256GP806, the pulse
                // gobbler delay ranges from 65-390 nsec, with 130 nsec being the typical value.
                I2C2BRG = ((1/__I2C_BAUD_RATE_MHZ)-0.13)*(__FCYC_MHz) - 1;
                I2C2CONbits.I2CEN = 1;                  // Enable I2C2 module.
                nIndex = 0;                             // Reset the index.
                nState = 53;
                nTimer = 1000;                
            break;

