fabiankung/Two_Wheels_Robot_V0_90S_OS/Firmware_Release/dsPIC33E_BoardSupport.c
            case 1: // State 1 - Dispatcher.
                if (gI2CStat.bRead == 1)                  // Reading data from Slave.
                {
                    gI2CStat.bI2CBusy = 1;                  // Indicate I2C module is occupied.
                    nState = 30;
                    nTimer = 1;
                }
                else if (gI2CStat.bSend == 1)             // Transmission of data to Slave.
                {
                    gI2CStat.bI2CBusy = 1;                // Indicate I2C module is occupied.
                    nState = 45;
                    nTimer = 1;                    
                }
                else
                {
                    nState = 1;
                    nTimer = 1;                    
                }
                break;

            // --- Multi-byte read ---
            case 30: // State 30 - Assert Start condition.
                if (I2C2STATbits.P == 1)                    // Make sure the I2C bus is in idle condition.
                {
                    I2C2CONbits.SEN = 1;                    // Assert Start condition on I2C bus.
                    nCount = 0;                             // Reset counter.
                    nState = 31;
                    nTimer = 1;                    
                }
                else
                {
                    nState = 30;
                    nTimer = 1;                    
                }             
            break;

           case 31: // State 31 - Tx slave device address, write mode.
                I2C2TRN = gbytI2CSlaveAdd<<1;            // Data = Slave address with R/W bit = 0 (Master is writing to the Slave).
                nState = 32;
                nTimer = 1;                
           break;

           case 32: // State 32 - Check status of device address transmission.
                if (I2C2STATbits.TRSTAT == 1)           // Check if Master transmission is still in progress.
                {
                    nState = 32;
                    nTimer = 1;                      
                }
                else                                    // Transmission end, check acknowledge from Slave.
                {
                    if (I2C2STATbits.ACKSTAT == 0)      // ACK received from Slave, continue.
                    {
                        gI2CStat.bCommError = 0;            // Clear communication error flag.
                        I2C2TRN = gbytI2CRegAdd;            // Send register address to read.
                        nState = 34;
                        nTimer = 1;                          
                    }
                    else                                // NAK received from Slave, end.
                    {
                        gI2CStat.bCommError = 1;        // Set communication error flag.
                        nState = 41;
                        nTimer = 1;                          
                    }    
                }
                break;

           case 34: // State 34 - Check status of transmission.
                if (I2C2STATbits.TRSTAT == 1)           // Check if Master transmission is still in progress.
                {
                    nState = 34;
                    nTimer = 1;                             
                }
                else                                    // Transmission end, check acknowledge from Slave.
                {
                    if (I2C2STATbits.ACKSTAT == 0)      // ACK received from Slave, continue.
                    {
                        gI2CStat.bCommError = 0;        // Clear communication error flag.
                        I2C2CONbits.RSEN = 1;                // Assert repeat start condition on I2C bus.
                        nState = 36;
                        nTimer = 1;                                 
                    }
                    else                                // NAK received from Slave, end.
                    {
                        gI2CStat.bCommError = 1;        // Set communication error flag.
                        nState = 41;
                        nTimer = 1;                                 
                    }                   
                }
                break;

           case 36: // State 36 - Tx slave device address, read mode.
                I2C2TRN = (gbytI2CSlaveAdd<<1) | 0x01;     // Data = Slave address with R/W bit = 1 (Master is reading from the Slave).
                nState = 37;
                nTimer = 1;                         
                break;

           case 37: // State 37 - Check status of transmission.
                if (I2C2STATbits.TRSTAT == 1)           // Check if Master transmission is still in progress.
                {
                    nState = 37;
                    nTimer = 1;                           
                }
                else                                    // Transmission end, check acknowledge from Slave.
                {
                    if (I2C2STATbits.ACKSTAT == 0)      // ACK received from Slave, continue.
                    {
                        gI2CStat.bCommError = 0;            // Clear communication error flag.
                        I2C2CONbits.RCEN = 1;               // Enable receive operation.
                        nTimeOut = 0;                       // Reset timeout timer.      
                        nState = 39;
                        nTimer = 1;                           
                                                            // Note: we can actually jump to state 38, but this
                                                            // will cause one tick delay.
                    }
                    else                                // NAK received from Slave, end.
                    {
                        gI2CStat.bCommError = 1;        // Set communication error flag.
                        nState = 41;
                        nTimer = 1;                         
                    }
                    
