fabiankung/Two_Wheels_Robot_V0_90S_OS/Firmware_Release/dsPIC33E_BoardSupport.c
                }
                break;

           case 38: // State 38 - Enable receive.
                I2C2CONbits.RCEN = 1;                    // Enable receive operation.
                nTimeOut = 0;                            // Reset timeout timer.
                nState = 39;
                nTimer = 1;                 
               break;

           case 39: // State 39 - Check for receive buffer full status.
                if (I2C2STATbits.RBF == 1)              // Check if all bits are received.
                {
                    gbytI2CRXbuf[nCount] = I2C2RCV;      // Get received data.
                    gbytI2CByteCount--;
                    nCount++;
                    // Check for end of data to read, or the I2C receive buffer is full.
                    if ((gbytI2CByteCount == 0) || (nCount == __MAX_I2C_DATA_BYTE))
                    {
                        I2C2CONbits.ACKDT = 1;              // Set NAK when receive data.
                        I2C2CONbits.ACKEN = 1;              // Enable acknowledge sequence.
                        gI2CStat.bI2CBusy = 0;              // I2C module is idle.
                        gI2CStat.bRead = 0;                 // Clear read flag.    
                        nState = 41;
                        nTimer = 1;                             
                    }
                    else                                    // Still in reading mode.
                    {
                        I2C2CONbits.ACKDT = 0;              // Set ACK when receive data.
                        I2C2CONbits.ACKEN = 1;              // Enable acknowledge sequence.  
                        nState = 38;
                        nTimer = 1;                             
                    }                    
                }
                else
                {
                    nTimeOut++;
                    if (nTimeOut > __I2C_TIMEOUT_COUNT)  // Check for timeout.
                    {
                        gI2CStat.bCommError = 1;        // Set communication error flag.
                        gbytI2CByteCount--;
                        nCount++;
                        // Check of end of data to read, or the I2C receive buffer is full.
                        if ((gbytI2CByteCount == 0) || (nCount == __MAX_I2C_DATA_BYTE))
                        {
                            I2C2CONbits.ACKDT = 1;              // Set NAK when receive data.
                            I2C2CONbits.ACKEN = 1;              // Enable acknowledge sequence.
                            gI2CStat.bI2CBusy = 0;              // I2C module is idle.
                            gI2CStat.bRead = 0;                 // Clear read flag.      
                            nState = 41;
                            nTimer = 1;                                 
                        }
                        else                                    // Still in reading mode.
                        {
                            I2C2CONbits.ACKDT = 0;              // Set ACK when receive data.
                            I2C2CONbits.ACKEN = 1;              // Enable acknowledge sequence.
                            nState = 38;
                            nTimer = 1;                                 
                        }
                    }
                    else
                    {
                        nState = 39;
                        nTimer = 1;                             
                        //OSSetTaskContext(ptrTask, 39, 1);   // Next state = 39, timer = 1.
                    }
                }
                break;

            case 41: // State 41 - End, initiate Stop condition on I2C bus and tidy up.
                     // Also to hasten the response of this driver, we run the dispatcher in this state.
                     // If there no data to be read from I2C bus, then the state-machine will revert
                     // to state 1 and wait for new commands.  By running the dispatcher here,
                     // the driver can immediately execute another read operation right after the 
                     // stop condition is generated.
                I2C2CONbits.PEN = 1;                    // Initiate Stop condition.
                if (gI2CStat.bRead == 1)                  // Reading data from Slave.
                {
                    gI2CStat.bI2CBusy = 1;                  // Indicate I2C module is occupied.
                    nState = 30;
                    nTimer = 1;                     
                }
                else if (gI2CStat.bSend == 1)             // Transmission of data to Slave.
                {
                    gI2CStat.bI2CBusy = 1;                // Indicate I2C module is occupied.
                    nState = 45;
                    nTimer = 1;                        
                }
                else
                {
                    nState = 1;
                    nTimer = 1;                     
                }                
                break;


            // --- Multi-byte write ---
            case 45: // State 45 - Assert Start condition.
                //gI2CStat.bI2CBusy = 1;                  // Indicate I2C module is occupied.
                nCount = 0;                             // Reset pointer.
                I2C2CONbits.SEN = 1;                    // Assert Start condition on I2C bus.
                nState = 46;
                nTimer = 1;                 
                break;

           case 46: // State 46 - Tx slave device address, write mode.
                I2C2TRN = gbytI2CSlaveAdd<<1;          // Data = Slave address with R/W bit = 0 (Master is writing to the Slave).
                nState = 47;
                nTimer = 1;                   
           break;

           case 47: // State 47 - Check status of transmission.
                if (I2C2STATbits.TRSTAT == 1)           // Check if Master transmission is still in progress.
                {
                    nState = 47;
                    nTimer = 1;                       
                }
                else                                    // Transmission end, check acknowledg from Slave.
                {
                    if (I2C2STATbits.ACKSTAT == 0)      // ACK received from Slave, proceed.
                    {
                        gI2CStat.bCommError = 0;
                        nState = 48;
                        nTimer = 1;                              
                    }
                    else                            // NAK received from Slave, end.
                    {
                        gI2CStat.bCommError = 1;        // Set communication error flag.
                        nState = 52;
                        nTimer = 1;                              
                    }                
                }
                break;
                
           case 48: // State 48 - TX start register to write to.
                I2C2TRN = gbytI2CRegAdd;                 // Send register address to update.
                nState = 49;
                nTimer = 1;                      
                break;

           case 49: // State 49 - Check status of transmission.
                if (I2C2STATbits.TRSTAT == 1)           // Check if Master transmission is still in progress.
                {
                    nState = 49;
                    nTimer = 1;                        
                }
                else                                    // Transmission end, check acknowledge from Slave.
                {
                    if (I2C2STATbits.ACKSTAT == 0)      // ACK received from Slave, proceed.
                    {
                        gI2CStat.bCommError = 0;
                        nState = 50;
                        nTimer = 1;                            
                    }
                    else                                // NAK received from Slave, end.
                    {
                        gI2CStat.bCommError = 1;        // Set communication error flag.
                        nState = 52;
                        nTimer = 1;                           
                    }                   
                }
                break;

