fabiankung/Two_Wheels_Robot_V0_90S_OS/Firmware_Release/dsPIC33E_BoardSupport.c
            case 50: // State 50 - TX data to Slave.
                I2C2TRN = gbytI2CTXbuf[nCount];          // Upload data for Slave.
                nState = 51;
                nTimer = 1;                   
                break;

            case 51: // State 51 - Check status of transmission.
                if (I2C2STATbits.TRSTAT == 1)           // Check if Master transmission is still in progress.
                {
                    nState = 51;
                    nTimer = 1;                        
                }
                else                                    // Transmission end, check acknowledge from Slave.
                {
                    if (I2C2STATbits.ACKSTAT == 0)      // ACK received from Slave.
                    {
                        gbytI2CByteCount--;
                        nCount++;
                        gI2CStat.bCommError = 0;
                        // Check for end of byte or reach end of I2C transmit buffer.
                        if ((gbytI2CByteCount == 0) || (nCount == __MAX_I2C_DATA_BYTE))
                        {
                            nState = 52;
                            nTimer = 1;                                
                        }
                        else
                        {
                            nState = 50;
                            nTimer = 1;                                 
                        }
                    }
                    else                                // NAK received from Slave.
                    {
                        gI2CStat.bCommError = 1;        // Set communication error flag.
                        nState = 52;
                        nTimer = 1;                             
                    }
                }
                break;

            case 52: // State 52 - End, initiate Stop condition on I2C bus.
                I2C2CONbits.PEN = 1;                    // Initiate Stop condition.
                nState = 53;
                nTimer = 1;                     
                break;

            case 53: // State 53 - Tidy up.
                gI2CStat.bI2CBusy = 0;                  // I2C module is idle.
                gI2CStat.bSend = 0;
                nState = 1;
                nTimer = 1;                    
                break;

            default:
                nState = 0;
                nTimer = 1;                    
            break;
        }
    }
}


DSPIC33E_A4988_DRIVER    gobjDriverA4988;
long        gnDistanceMoveLW = 0;   // Distance traveled by left wheel in no. of steps, 32 bits integer.
long        gnDistanceMoveRW = 0;   // Distance traveled by right wheel in no. of steps, 32 bits integer.
long        gnDistanceMoveW = 0;    // Average distance traveled by both wheels in no. of steps, 32 bits integer.
int         gnHeading = 0;          // This indicates the direction, essentially the difference between right and left 
                                    // wheel distance.  Facing right if > 0, and facing left if < 0.			
unsigned int    gunDeadBandThres = 1 ; // Deadband threshold, speed setting less than this magnitude will be ignored.
#define _DISABLE_A4988                   1
#define _ENABLE_A4988                    0

///
/// Process name	: A4988StepperMotorDriver
///
/// Author			: Fabian Kung
///
/// Last modified   : 25 Oct 2019
///
/// Code Version	: 0.95
///
/// Processor		: dsPIC33EP256MU80X family.
///                   dsPIC33EP512MC80X family.
///
/// Processor/System Resources 
/// PINS			: 1. RD4 - Step output to A4988 chip 1.
///                   2. RB6 - Direction output to A4988 chip 1. 
///                   3. RD5 - Step output to A4988 chip 2.
///                   4. RB7 - Direction output to A4988 chip 2. 
///                   5. RB9 - Enable pin control for both A4988 chips.
///                            Low = disable FET outputs of both chips.
///                            High = enable FET outputs of both chips.
/// 
/// MODULES			: 1. OC7 (Internal) for Motor1.
///                   2. OC8 (Internal) for Motor2.
///                   3. TIMER3, with 70 MHz processor clock.
///
/// RTOS			: Ver 1 or above, round-robin scheduling.
///
/// Global variables	: gobjDriverA4988
///                       gnDistanceMoveLW
///                       gnDistanceMoveRW
///                       gnDistanceMoveW
///                       gnHeading


/// Description	: Subroutine to drive the A4988 or compatible (such as DRV8825) bi-phase stepper motor driver chips.
///               This driver supports two A4988 chips, e.g. two stepper motors, driven in quarter-step (0.45 
///               degree) mode.
///               The codes make uses of linearization algorithm between the speed setting and 
///               pulse duration adapted from J. Brokking's codes for arduino,
///               in: http://www.brokking.net/yabr_main.html
///               The process uses the internal Output Compare (OC) module of the dsPIC33 processors in 
///               edge-aligned PWM mode to generate the periodic step pulses (OCM<2:0> = 110).  The corresponding
///               OCxTMR counter will increment from 0 to a value equal to OCxRS, then reset and repeat. Thus the
///               periodic frequency of the pulses is determined by value stored in OCxRS. The frequency of the
///               PWM pulses is proportional to the rotational speed needed.  Another I/O pin is used 
///               to control the DIR (direction).  In addition to driving the stepper motor, this process also 
///               keep track of the instantaneous distance traveled by the left and right wheels (assuming no 
///               slippage) by sampling the STEP pins to the stepper motor driver.
///                    
/// Example of usage: 
/// 1) To start the sampling and conversion, we first set gobjDriverA4988.unEn4988 to 1 or larger. 
/// 2) Then we set nSpeed1 or nSpeed2 to between -800 and +800.  Values between -gunDeadBandThres to +gunDeadBandThres
///    will stop the motor.  The driver codes has a linearization routines, which will
///    generate almost linear angular velocity output.  See the Excel file for more detail of the algorithm. 
///
/// 3) The global variables gnDistanceMoveLW, gnDistanceMoveRW, gnDistanceMoveW and gnHeading
///    stores the instantaneous left wheel distance, right wheel distance, average wheel 
///    distance and the heading.  User routines can read this value as frequently as needed.
///    These global variables will be cleared to 0 whenever the driver is disabled.
///    Disabling the driver by setting gobjDriverA4988.unEn4988 to 0 or smaller will reset
///    all these registers to zero.

#define PIN_STEPPER_DIR1                 _RB6 
#define PIN_STEPPER_DIR2                 _RB7 
#define PIN_A4988_ENABLE                 _RB9
#define PIN_STEPPER_STEP1                _RD4
#define PIN_STEPPER_STEP2                _RD5

#if __FOSC_MHz < 116    // Check processor clock frequency, this driver may not work
                        // properly if clock frequency is below 116 MHz.
    #error "Proce_A4988_Driver: Processor frequency is less than 59 MHz, this driver may not work properly"
#endif

