fabiankung/Two_Wheels_Robot_V0_90S_OS/Firmware_Release/dsPIC33E_BoardSupport.c
#define  T3_PS	64                                                           // TIMER3 Prescalar.

#define	_STEPPER_MOTOR_PULSE_WIDTH      8       // The pulse width for the STEP pulse, in multiples of the period resolution.
                                                // For instance if the period resolution is 20 usec, and this value is 9, then
                                                // each pulse will be 180 usec.  Thus we need to make sure that 
                                                // _STEPPER_MOTOR_MIN_PERIOD_US is greater than this value.  Setting this value
                                                // smaller will allow higher maximum frequency of the STEP control pulse, but 
                                                // beware on the implication on EMC and signal integrity issue that might affect
                                                // the shape of the pulse.
#define _STEPPER_MOTOR_PERIOD_RESOLUTION_US    20      // This is the smallest increment/decrement.
#define _STEPPER_MOTOR_COUNT            _STEPPER_MOTOR_PERIOD_RESOLUTION_US/(__TCLK_US*T3_PS)  // No. of count needed in 
                                                                                               // timer T3 for 1 period
                                                                                               // resolution.
//#define _STEPPER_MOTOR_MIN_SPEED        0
//#define _STEPPER_MOTOR_MAX_SPEED        800


void A4988StepperMotorDriver(void)
{
    static int  nState = 0;
    static int  nTimer = 1;
    int nTemp, nTemp2;
    long nlTemp;
    static int  nLeftOutHigh = 0;
    static int  nRightOutHigh = 0;
    
    nTimer--;                   // Decrement timer.
    if (nTimer == 0)
    {
        switch (nState)
        {
            case 0: // State 0 - Initialization OC7 and OC8 to PWM mode, with clock source 
                    // provided by Timer3.
                
                TRISBbits.TRISB6 = 0;                   // Set RB6 as output.
                TRISBbits.TRISB7 = 0;                   // Set RB7 as output.
                TRISBbits.TRISB9 = 0;                   // Set RB9 as output.
                TRISFbits.TRISF4 = 0;                   // Set RF4 as output.
                TRISFbits.TRISF5 = 0;                   // Set RF5 as output.
                
                PIN_A4988_ENABLE = _DISABLE_A4988;      // First disable all the FET outputs of the A4988 chips.
                
                // Settings of remappable output pin. The cluster of bits RPnR
                // control the mapping of the pin internal peripheral output.
                // Note n = integer.  If we refer to the datasheet, pin RF4
                // is also called RP100, and RP100R bits are contained in
                // the special function register RPOR9 in the controller.
                RPOR2bits.RP68R = 0b010110;             // RP68 or RD4 connected to OC7's output.
                RPOR2bits.RP69R = 0b010111;             // RP69 or RD5 connected to OC8's output.
                //RPOR9bits.RP100R = 0b010110;             // RP100 or RF4 connected to OC7's output.
                //RPOR9bits.RP101R = 0b010111;             // RP101 or RF5 connected to OC8's output.
                
                OC7CON1 = 0;                            // Initialize both control registers for OC7.     
                OC7CON2 = 0;
                OC8CON1 = 0;                            // Initialize both control registers for OC8.     
                OC8CON2 = 0;                
                
                OC8CON1bits.OCSIDL = 1;                 // Output Compare 1 halts when in idle mode.
                OC8CON2bits.SYNCSEL = 0b11111;          // 0x1F, No trigger or sync source is selected.  
                                                        // The internal timer OC8TMR resets when it reaches 
                                                        // the value of OC8RS.
                OC8CON1bits.OCTSEL = 0x01;              // Timer3 provides the clock source. 
                //OC8CON1bits.OCM = 0b110;                // Set OC8 to PWM mode.                 
                                                        // Note: 4/7/2017 F.Kung
                                                        // I discovered that this frequency is given by:
                                                        // fclock = fsource / pre-scalar
                                                        // fsource is the input clock source for Timer 3,
                                                        // which is the peripheral clock in this case.
                OC7CON1bits.OCSIDL = 1;                 // Same settings as OC8.
                OC7CON2bits.SYNCSEL = 0b11111;
                OC7CON1bits.OCTSEL = 0x01;
                //OC7CON1bits.OCM = 0b110;
                OC8RS = 0;  
                OC7RS = 0;
                OC8R = 0;
                OC7R = 0;
                OC8TMR = 0x0000;
                OC7TMR = 0x0000;       
                
                T3CONbits.TSIDL = 1;                    // Stop TIMER3 when in idle mode.
                T3CONbits.TCS = 0;                      // Clock source for TIMER3 is peripheral clock (Tclk/2).
                T3CONbits.TCKPS = 0b10;                 // TIMER3 prescalar = 1:64.
                T3CONbits.TON = 1;                      // Turn on TIMER3.
                TMR3 = 0x0000;                          // Reset TIMER.
                
                gobjDriverA4988.nSpeed1 = 0;
                gobjDriverA4988.nSpeed2 = 0;
                nState = 1;
                nTimer = 100*__NUM_SYSTEMTICK_MSEC;			 
            break;

            case 1: // State 1 - Wait for module to be enabled.
                if (gobjDriverA4988.unEn4988 > 0)       // Check if module is enabled.
                {
                    nState = 2;
                    nTimer = 1;                    
                    if (OC8CON1bits.OCM != 0b110)       // If the OC8 is not in PWM mode,
                    {                                   // set it to PWM mode.
                        OC8CON1bits.OCM = 0b110;        
                    }
                    if (OC7CON1bits.OCM != 0b110)       // If the OC7 is not in PWM mode,
                    {                                   // set OC7 to PWM mode.
                        OC7CON1bits.OCM = 0b110;        
                    }
                }
                else
                {
                    PIN_A4988_ENABLE = _DISABLE_A4988;  // Cut-off the power to stepper motor.
                    OC7CON1bits.OCM = 0b000;            // Turn off OC7 and OC8.
                    OC8CON1bits.OCM = 0b000;
                    gobjDriverA4988.nSpeed1 = 0;        // Reset motor 1 and motor 2 speed settings.
                    gobjDriverA4988.nSpeed2 = 0;
                    gnDistanceMoveLW = 0;               // Clear all distance counters.
                    gnDistanceMoveRW = 0;
                    gnDistanceMoveW = 0;
                    gnHeading = 0;                      // Reset heading register.
                    nState = 1;
                    nTimer = 1;                             
                }                
                      
                // Update distance counters by polling the OC7 and OC8 output pins.  Also compute average
                // distance and heading.
                if ((nLeftOutHigh == 0) && (PIN_STEPPER_STEP1 == 1)) // Check for low-to-high transition on left motor output.
                {
                    if (PIN_STEPPER_DIR1 == 0)          // Check for forward direction.
                    {
                        gnDistanceMoveLW++;
                    }
                    else
                    {
                        gnDistanceMoveLW--;
                    }
                    nLeftOutHigh = 1;                   // Indicate that low-to-high transition has already occur.
                }
                else if ((nLeftOutHigh == 1) && (PIN_STEPPER_STEP1 == 0))
                {
                    nLeftOutHigh = 0;
                }
                if ((nRightOutHigh == 0) && (PIN_STEPPER_STEP2 == 1)) // Check for low-to-high transition on right motor output.
                {
                    if (PIN_STEPPER_DIR2 == 1)              // Check for forward direction.
                    {
                        gnDistanceMoveRW++;
                    }
                    else
                    {
                        gnDistanceMoveRW--;
                    }
                    nRightOutHigh = 1;                   // Indicate that low-to-high transition has already occur.
                }
                else if ((nRightOutHigh == 1) && (PIN_STEPPER_STEP2 == 0))
                {
                    nRightOutHigh = 0;
                } 
                nlTemp = gnDistanceMoveLW + gnDistanceMoveRW;       // Compute the average distance traveled.  Here a long integer
                gnDistanceMoveW = nlTemp >> 1;                      // is used to prevent overflow. Divide by 2.
                gnHeading = gnDistanceMoveRW - gnDistanceMoveLW;    // Compute the direction or heading.
            break;

            case 2: // State 2 - Scan unSpeed1 and set the OC7 module accordingly.  
                nTemp = gobjDriverA4988.nSpeed1;                
                if (nTemp < 0)      
                {
                    PIN_STEPPER_DIR1 = 1;
                    nTemp = -nTemp;
                }
                else
                {
                    PIN_STEPPER_DIR1 = 0; 
                }
                
