fabiankung/Two_Wheels_Robot_V0_90S_OS/Firmware_Release/dsPIC33E_BoardSupport.c
                if (nTemp > gunDeadBandThres)      // There is a deadband.  For two-wheels robot 
                {                   // a small deadband can reduce unwanted oscillation.    
                   // NOTE: 18 May 2019, by F. Kung.
                   // The wheel angular velocity is generated by a series of pulses to the STEP input of A4988
                   // chip.  The higher the frequency the faster is the rotation speed.  However the frequency
                   // is inversely proportional to the period of 1 pulse.  This inverse relation between the
                   // set velocity and period is non-linear, thus a compensation routine is needed.
                   // The compensation routine for non-linear relationship between angular 
                   // velocity and pulse period is based J. Brokking codes for 
                   // Arduino. Where for positive speed setting:        
                   // NewSpeedSetting = 805 - 5500/(SpeedSettings + 9)
                   // For negative speed setting:
                   // NewSpeedSetting = -805 - 5500/(SpeedSettings - 9)
                   // Since this is inversely proportional to the step interval, 
                   // we subtract from the maximum time interval.
                   // Here the first coefficient 5500 can be increase or decrease to change the slope of the mapping 
                   // between set velocity and actual motor shaft rotation speed.  See the corresponding Excel file
                   // for further information.
                   PIN_A4988_ENABLE = _ENABLE_A4988;
                   nTemp2 = 11000/(nTemp+9);
                   OC7R = _STEPPER_MOTOR_PULSE_WIDTH*_STEPPER_MOTOR_COUNT;      // Set OC7 output pin to high. The width of the 
                                                                                // the pulse is determined by 
                   OC7RS = nTemp2*_STEPPER_MOTOR_COUNT;                         // _STEPPER_MOTOR_PULSE_WIDTH*_STEPPER_MOTOR_COUNT
                                                                                // while the period is set by OC7RS value.  We must
                                                                                // make sure OC7RS >= OC7R at all times! 
                }
                else
                {
                    PIN_A4988_ENABLE = _DISABLE_A4988;                          // Cut-off the power to stepper motor when
                                                                                // not turning.  This depends on application, 
                                                                                // it means there will be no holding torque
                                                                                // when the motor is not turning. Turning the motor
                                                                                // off when not moving reduces power consumption
                                                                                // and makes the stepper motor cooler.       
                    OC7R = 0;
                    OC7RS = 0;                    
                }                                                               
                                                                                               
                // Note: 30 Aug 2017, the above codes to set the Output Compare unit needs to execute first
                // before we update the distance ticks.
                if ((nLeftOutHigh == 0) && (PIN_STEPPER_STEP1 == 1)) // Check for low-to-high transition on left motor output.
                {
                    if (PIN_STEPPER_DIR1 == 0)          // Check for forward direction.
                    {
                        gnDistanceMoveLW++;
                    }
                    else
                    {
                        gnDistanceMoveLW--;
                    }
                    nLeftOutHigh = 1;                   // Indicate that low-to-high transition has already occur.
                }
                else if ((nLeftOutHigh == 1) && (PIN_STEPPER_STEP1 == 0))
                {
                    nLeftOutHigh = 0;
                }                
                if ((nRightOutHigh == 0) && (PIN_STEPPER_STEP2 == 1))    // Check for low-to-high transition on right motor output.
                {
                    if (PIN_STEPPER_DIR2 == 1)              // Check for forward direction.
                    {
                        gnDistanceMoveRW++;
                    }
                    else
                    {
                        gnDistanceMoveRW--;
                    }
                    nRightOutHigh = 1;                   // Indicate that low-to-high transition has already occur.
                }
                else if ((nRightOutHigh == 1) && (PIN_STEPPER_STEP2 == 0))
                {
                    nRightOutHigh = 0;
                }                    
                nState = 3;
                nTimer = 1;                          
            break;

            case 3: // State 3 - Scan unSpeed2 and set the OC8 module accordingly. 
                nTemp = gobjDriverA4988.nSpeed2;                
                if (nTemp < 0)
                {
                    PIN_STEPPER_DIR2 = 0;
                    nTemp = -nTemp;
                }
                else
                {
                    PIN_STEPPER_DIR2 = 1; 
                }
                if (nTemp > gunDeadBandThres)      // There is a deadband.
                {                    
                   PIN_A4988_ENABLE = _ENABLE_A4988;
                   nTemp2 = 11000/(nTemp+9);               
                   OC8R = _STEPPER_MOTOR_PULSE_WIDTH*_STEPPER_MOTOR_COUNT;      // Set OC8 output pin to high.  The width of the 
                                                                                // pulse is determined by the value
                   OC8RS = nTemp2*_STEPPER_MOTOR_COUNT;                         // _STEPPER_MOTOR_PULSE_WIDTH*_STEPPER_MOTOR_COUNT
                                                                                // while the value in OC8RS sets the period. We must
                                                                                // make sure OC8RS >= OC8R at all times!    
                }
                else
                {
                    PIN_A4988_ENABLE = _DISABLE_A4988;                          // Cut-off the power to stepper motor when
                                                                                // not turning.  This depends on application,
                                                                                // it means there will be no holding torque
                                                                                // when the motor is not turning. Turning the motor
                                                                                // off when not moving reduces power consumption
                                                                                // and makes the stepper motor cooler.
                    OC8R = 0;                                                   // By setting OC8R = OC8RS, output pin of OC8
                    OC8RS = 0;                                                  // will be driven to low when not active.
                }                                                                
                                                                                
                // Note: 30 Aug 2017, the above codes to set the Output Compare unit needs to execute first
                // before we update the distance ticks.
                if ((nLeftOutHigh == 0) && (PIN_STEPPER_STEP1 == 1)) // Check for low-to-high transition on left motor output.
                {
                    if (PIN_STEPPER_DIR1 == 0)          // Check for forward direction.
                    {
                        gnDistanceMoveLW++;
                    }
                    else
                    {
                        gnDistanceMoveLW--;
                    }
                    nLeftOutHigh = 1;                   // Indicate that low-to-high transition has already occur.
                }
                else if ((nLeftOutHigh == 1) && (PIN_STEPPER_STEP1 == 0))
                {
                    nLeftOutHigh = 0;
                }                
                if ((nRightOutHigh == 0) && (PIN_STEPPER_STEP2 == 1)) // Check for low-to-high transition on right motor output.
                {
                    if (PIN_STEPPER_DIR2 == 1) 
                    {
                        gnDistanceMoveRW++;
                    }
                    else
                    {
                        gnDistanceMoveRW--;
                    }
                    nRightOutHigh = 1;                   // Indicate that low-to-high transition has already occur.
                }
                else if ((nRightOutHigh == 1) && (PIN_STEPPER_STEP2 == 0))
                {
                    nRightOutHigh = 0;
                }      
                nState = 1;
                nTimer = 1;                                    
                break;
                
            case 10: // State 10 - Stop the motor.
                OC7CON1bits.OCM = 0b000;
                OC8CON1bits.OCM = 0b000;
                nState = 1;
                nTimer = 1;                  
                break;
                
            default:
                nState = 0;
                nTimer = 1;                  
            break;
        }
    }
}


//////////////////////////////////////////////////////////////////////////////////////////////
//  END OF CODES SPECIFIC TO dsPIC33EXXXX MICROCONTROLLER	   ///////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////
